DataProcessors/ЖурналЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЖурналЗаписей</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Деньги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Деньги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Запись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Запись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаписей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Салоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Салоны</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СалоныПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РежимРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийДень</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЖурналЗаписей/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	Салон = Справочники.Салоны.ОсновнойСалон();
	
	СоздатьИзмеренияПланировщика();	
	ОбновитьПериодОтображенияПланировщика();
	
	ЗаполнитьЖурналЗаписей();
	
КонецПроцедуры                           

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменение_Запись" Тогда
		КоличествоДоИзменения = Планировщик.Элементы.Количество();
		ЗаполнитьЖурналЗаписей();
		//Если КоличествоДоИзменения < Планировщик.Элементы.Количество() Тогда
		//ПоказатьОповещениеПользователя("Новая запись",,Планировщик.Элементы[Планировщик.Элементы.Количество()-1].Текст,БиблиотекаКартинок.ОформлениеКругЗеленый,СтатусОповещенияПользователя.Важное);	
		//КонецЕсли;
	ИначеЕсли ИмяСобытия = "Изменение_Оплата" Тогда
		ЗаполнитьДиаграмму();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	ЕстьЗапись =  ПроверитьДоступностьЗаписиНаСервере(Салон,Начало,Конец,ЗначенияИзмерений["Сотрудник"]);
	
	Если ЕстьЗапись <> Неопределено Тогда
		Сообщить("Данное время не доступно для записи так как уже есть запись: "+ЕстьЗапись.Запись +Символы.ПС 
		+"Клиент: " + ЕстьЗапись.Клиент); 	
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;                     
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Салон", Салон);
	ЗначенияЗаполнения.Вставить("Дата", Начало);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", Конец);
	ЗначенияЗаполнения.Вставить("Сотрудник", ЗначенияИзмерений["Сотрудник"]);
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.Запись.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры 

&НаСервере
Функция ПроверитьДоступностьЗаписиНаСервере(Салон, Начало, Конец, Сотрудник)
	Возврат Veltrix_СлужебныеПроцедурыИФункции.ПроверитьДоступностьЗаписи(Салон, Начало, Конец, Сотрудник);
КонецФункции

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;  
	
	ЭлементПланировщика = ВыделенныеЭлементы[0];
	
	СтруктураПараметров = Новый Структура("Ключ", ЭлементПланировщика.Значение);
	ОткрытьФорму("Документ.Запись.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)

	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;  
	ЭлементПланировщика = ВыделенныеЭлементы[0];
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("Дата", ЭлементПланировщика.Начало);
	ЗначенияРеквизитов.Вставить("ДатаОкончания", ЭлементПланировщика.Конец);
	ЗначенияРеквизитов.Вставить("Сотрудник", ЭлементПланировщика.ЗначенияИзмерений["Сотрудник"]);
	
	ОбновитьДанныеЗаписи(ЭлементПланировщика.Значение, ЗначенияРеквизитов);
	
КонецПроцедуры    

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура СалонПриИзменении(Элемент)

	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()
	
	Салон = Справочники.Салоны.ОсновнойСалон();
	ДеньНедели = Метаданные.Перечисления.ДниНедели.ЗначенияПеречисления[ДеньНедели(ТекущаяДата())-1];
	
	Начало = Минута(Салон.РежимРаботы[0].ВремяНачала);
	РежимРаботы = Салон.РежимРаботы.Выгрузить();
	ТекРабочееВремя = РежимРаботы.Найти(Перечисления.ДниНедели[ДеньНедели.Имя],"ДеньНедели");
	Если ТекРабочееВремя.РабочийДень Тогда
	
	//Начало = НачалоДня(Дата) + 9*3600;
	//Конец = НачалоДня(Дата) + 19*3600;  
	Начало = ПолучитьСегодняСВременем (ТекРабочееВремя.ВремяНачала);
	Конец = ПолучитьСегодняСВременем (ТекРабочееВремя.ВремяОкончания);
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало, Конец);
	Иначе 
	Сообщить("На эту дату салон не работает......"); 
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	КонецЕсли;

КонецПроцедуры // ОбновитьПериодОтображенияПланировщика()

Функция ПолучитьСегодняСВременем(ДатаШаблон) Экспорт
	
	ТекДата = ТекущаяДата();
	
	Возврат Дата(
		Год(ТекДата),
		Месяц(ТекДата),
		День(ТекДата),
		Час(ДатаШаблон),
		Минута(ДатаШаблон),
		Секунда(ДатаШаблон)
	);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЖурналЗаписей()
	
	Планировщик.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Запись.Дата КАК Дата,
		|	Запись.Салон КАК Салон,
		|	Запись.Сотрудник КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Запись.Услуга) КАК Услуга,
		|	Запись.Длительность КАК Длительность,
		|	Запись.Сумма КАК Сумма,
		|	Запись.Клиент КАК Клиент,
		|	Запись.ДатаОкончания КАК ДатаОкончания,
		|	Запись.Комментарий КАК Комментарий,
		|	Запись.Ссылка КАК Ссылка,
		|	Запись.Клиент.Телефон КАК Телефон,
		|	Запись.Цвет КАК Цвет,
		|	Запись.КоличествоУслуг КАК КоличествоУслуг
		|ИЗ
		|	Документ.Запись КАК Запись
		|ГДЕ
		|	Запись.Проведен
		|	И Запись.Салон = &Салон
		|	И Запись.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Салон", Салон);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗначенияИзмерений = Новый Соответствие;
		ЗначенияИзмерений.Вставить("Сотрудник", Выборка.Сотрудник);
		
		ЖирныйШрифт = Новый Шрифт(,,Истина);		                                                                       
		
		ПредставлениеКлиента = Строка(Выборка.Клиент) + ", " + Выборка.Телефон;
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ПредставлениеКлиента, ЖирныйШрифт)); 		
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить("Количество услуг: "+Выборка.КоличествоУслуг);	
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(Выборка.Услуга);
		МассивСтрок.Добавить(Символы.ПС);
		Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
			МассивСтрок.Добавить("-- " + Выборка.Комментарий);
		КонецЕсли;
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(Выборка.Дата, Выборка.ДатаОкончания);
		ЭлементПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначенияИзмерений);	
		ЭлементПланировщика.Значение = Выборка.Ссылка;
		ЭлементПланировщика.Текст = Новый ФорматированнаяСтрока(МассивСтрок);
		Цвет = Выборка.Цвет.Получить();
		Если Цвет = Неопределено Тогда
			Цвет = WebЦвета.БледноЛиловый;
		КонецЕсли;
		
		ЭлементПланировщика.ЦветФона = Цвет;
		
	КонецЦикла;
	
	ЗаполнитьДиаграмму();
	
КонецПроцедуры // ЗаполнитьЖурналЗаписей()

&НаСервере
Процедура ЗаполнитьДиаграмму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДеньгиОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ДеньгиОбороты.СуммаПриход КАК СуммаПриход
		|ИЗ
		|	РегистрНакопления.Деньги.Обороты(&ДатаНачала, &ДатаОкончания, , Салон = &Салон) КАК ДеньгиОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("Салон", Салон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Точка = Диаграмма.Точки.Добавить("");
	Пока Выборка.Следующий() Цикл
		Серия = Диаграмма.Серии.Добавить(Строка(Выборка.ТипДенежныхСредств));
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.СуммаПриход);
	КонецЦикла;                 
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры // ЗаполнитьДиаграмму()

&НаСервере
Процедура СоздатьИзмеренияПланировщика()

	Измерение = Планировщик.Измерения.Добавить("Сотрудник");
	
	Выборка = Справочники.Сотрудники.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;		
		
		ЗначениеИзмерения = Измерение.Элементы.Добавить(Выборка.Ссылка);	
		ЗначениеИзмерения.Текст = Выборка.Наименование + Символы.ПС + Выборка.Должность;
		ЗначениеИзмерения.ЦветРамки = WebЦвета.Синий;
	
	КонецЦикла;

КонецПроцедуры // СоздатьИзмеренияПланировщика()

&НаСервереБезКонтекста
Процедура ОбновитьДанныеЗаписи(Запись, ЗначенияРеквизитов)
	
	ОбъектЗаписи = Запись.ПолучитьОбъект();
	
	ЕстьИзмения = Ложь;
	Для каждого Реквизит Из ЗначенияРеквизитов Цикл
		Если ОбъектЗаписи[Реквизит.Ключ] <> Реквизит.Значение Тогда
			ЕстьИзмения = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;	
	
	Если ЕстьИзмения Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаписи, ЗначенияРеквизитов);
		ОбъектЗаписи.Длительность = (ОбъектЗаписи.ДатаОкончания - ОбъектЗаписи.Дата) / 60;
		ОбъектЗаписи.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;   
	
КонецПроцедуры // ОбновитьДанныеЗаписи()

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Test = "";

КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура КомандаОбновитьНаСервере()
	
	Дата = ТекущаяДата();
	
	ОбновитьПериодОтображенияПланировщика();
	
	ЗаполнитьЖурналЗаписей();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	////#Если ВебКлиент Тогда	
	//ДанныеЭкранаКлиента = ПолучитьИнформациюЭкрановКлиента();	
	//Высота = ДанныеЭкранаКлиента[0].Высота; 
	//Ширина = ДанныеЭкранаКлиента[0].Ширина; 
	////Если Veltrix_АдаптацияИнтерфейса.ЭтоМобильноеУстройство(Ширина,Высота) Тогда	
	//	//ЭтаФорма.Закрыть(); 
	//	//Отказ = Истина;
	//	ОткрытьФорму("Документ.Запись.Форма.ФормаДокумента",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//Возврат;
	////КонецЕсли;
	////#КонецЕсли
	
КонецПроцедуры


 #КонецОбласти
